tk20dk/lucy/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_ll_adc.h"
#include "stm32l0xx_ll_dma.h"
#include "stm32l0xx_ll_lpuart.h"
#include "stm32l0xx_ll_rcc.h"
#include "stm32l0xx_ll_crs.h"
#include "stm32l0xx_ll_bus.h"
#include "stm32l0xx_ll_system.h"
#include "stm32l0xx_ll_exti.h"
#include "stm32l0xx_ll_cortex.h"
#include "stm32l0xx_ll_utils.h"
#include "stm32l0xx_ll_pwr.h"
#include "stm32l0xx_ll_rtc.h"
#include "stm32l0xx_ll_spi.h"
#include "stm32l0xx_ll_usart.h"
#include "stm32l0xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HMI_RED_Pin LL_GPIO_PIN_14
#define HMI_RED_GPIO_Port GPIOC
#define HMI_GREEN_Pin LL_GPIO_PIN_15
#define HMI_GREEN_GPIO_Port GPIOC
#define MUX_A0_Pin LL_GPIO_PIN_0
#define MUX_A0_GPIO_Port GPIOA
#define MUX_EN_Pin LL_GPIO_PIN_1
#define MUX_EN_GPIO_Port GPIOA
#define MUX_DATA_Pin LL_GPIO_PIN_2
#define MUX_DATA_GPIO_Port GPIOA
#define MUX_A1_Pin LL_GPIO_PIN_3
#define MUX_A1_GPIO_Port GPIOA
#define MUX_A2_Pin LL_GPIO_PIN_4
#define MUX_A2_GPIO_Port GPIOA
#define ADC_VBAT_Pin LL_GPIO_PIN_0
#define ADC_VBAT_GPIO_Port GPIOB
#define HMI_BUZZER_Pin LL_GPIO_PIN_1
#define HMI_BUZZER_GPIO_Port GPIOB
#define RADIO_DIO2_Pin LL_GPIO_PIN_8
#define RADIO_DIO2_GPIO_Port GPIOA
#define RADIO_DIO2_EXTI_IRQn EXTI4_15_IRQn
#define RADIO_DIO1_Pin LL_GPIO_PIN_9
#define RADIO_DIO1_GPIO_Port GPIOA
#define RADIO_DIO1_EXTI_IRQn EXTI4_15_IRQn
#define RADIO_DIO0_Pin LL_GPIO_PIN_10
#define RADIO_DIO0_GPIO_Port GPIOA
#define RADIO_DIO0_EXTI_IRQn EXTI4_15_IRQn
#define PWR_SENSOR_Pin LL_GPIO_PIN_15
#define PWR_SENSOR_GPIO_Port GPIOA
#define RADIO_CS_Pin LL_GPIO_PIN_3
#define RADIO_CS_GPIO_Port GPIOB
#define RADIO_RESET_Pin LL_GPIO_PIN_4
#define RADIO_RESET_GPIO_Port GPIOB
#define HMI_PB5_Pin LL_GPIO_PIN_5
#define HMI_PB5_GPIO_Port GPIOB
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
